officialdanielamani/ESP_MenuSystem/src/ESP32_MenuSystem.cpp
// ESP32_MenuSystem.cpp
#include "ESP32_MenuSystem.h"

// Button mode constructor
ESP32_MenuSystem::ESP32_MenuSystem(U8G2* u8g2Display, int upPin, int downPin, int okPin)
    : display(u8g2Display), 
      inputMode(INPUT_BUTTONS),
      buttonUpPin(upPin), 
      buttonDownPin(downPin), 
      buttonOkPin(okPin),
      encoder(nullptr),
      standardFont(u8g2_font_5x8_tr),
      titleFont(u8g2_font_6x12_tr),
      valueFont(u8g2_font_10x20_tr),
      screenWidth(128),
      screenHeight(64) {
    
    // Initialize other parameters
    menuCount = 0;
    currentMenuIndex = 0;
    cursorPosition = 0;
    isValueAdjustMode = false;
    currentValueAdjuster = nullptr;

    // Initialize button trigger types to default (TRIGGER_LOW)
    buttonUpTriggerType = TRIGGER_LOW;
    buttonDownTriggerType = TRIGGER_LOW;
    buttonOkTriggerType = TRIGGER_LOW;
    encoderButtonTriggerType = TRIGGER_LOW;

    // Initial layout calculation
    titleHeight = 12;
    separatorY = 12;
    menuStartY = 22;
    lineHeight = 10;
    menuItemsVisible = 4;
    scrollIndicatorWidth = 3;
    menuItemPadding = 2; 

    displayOffsetX = 0;
    displayOffsetY = 0;
    useDisplayOffset = false;
    
    // Initialize button states
    buttonUpState = false;
    buttonDownState = false;
    buttonOkState = false;
    lastButtonUpState = false;
    lastButtonDownState = false;
    lastButtonOkState = false;
    
    lastDebounceTime = 0;
    debounceDelay = 50; // 50ms debounce
    
    previousMillis = 0;
    interval = 1000; // Default 1 second interval
    
    errorCode = 0;
    errorMessage[0] = '\0';
    
    // Set up button pins
    pinMode(buttonUpPin, INPUT_PULLUP);
    pinMode(buttonDownPin, INPUT_PULLUP);
    pinMode(buttonOkPin, INPUT_PULLUP);
}

// Encoder mode constructor
ESP32_MenuSystem::ESP32_MenuSystem(U8G2* u8g2Display, int encoderA, int encoderB, int encoderBtn, bool useEncoder, int sensitivity)
    : display(u8g2Display), 
      inputMode(INPUT_ENCODER),
      encoderPinA(encoderA), 
      encoderPinB(encoderB), 
      encoderButtonPin(encoderBtn),
      encoderSensitivity(sensitivity),
      encoderAccumulator(0),
      standardFont(u8g2_font_5x8_tr),
      titleFont(u8g2_font_6x12_tr),
      valueFont(u8g2_font_10x20_tr),
      screenWidth(128),
      screenHeight(64) {
    
    menuCount = 0;
    currentMenuIndex = 0;
    cursorPosition = 0;
    isValueAdjustMode = false;
    currentValueAdjuster = nullptr;

    // Initialize button trigger types to default (TRIGGER_LOW)
    buttonUpTriggerType = TRIGGER_LOW;
    buttonDownTriggerType = TRIGGER_LOW;
    buttonOkTriggerType = TRIGGER_LOW;
    encoderButtonTriggerType = TRIGGER_LOW;

    // Initial layout calculation based on default values
    titleHeight = 12;
    separatorY = 12;
    menuStartY = 22;
    lineHeight = 10;
    menuItemsVisible = 4;
    scrollIndicatorWidth = 3;
    menuItemPadding = 2; 

    displayOffsetX = 0;
    displayOffsetY = 0;
    useDisplayOffset = false;
    
    // Initialize encoder
    #ifdef USE_ESP32_ENCODER
    encoder = new ESP32Encoder();
    ESP32Encoder::useInternalWeakPullResistors = puType::up;
    encoder->attachHalfQuad(encoderPinA, encoderPinB);
    encoder->setCount(0);
    #else
    encoder = new InterruptEncoder();
    encoder->attach(encoderPinA, encoderPinB);
    #endif
    lastEncoderValue = 0;
    
    // Initialize encoder button state
    encoderButtonState = false;
    lastEncoderButtonState = false;
    
    lastDebounceTime = 0;
    debounceDelay = 50; // 50ms debounce
    
    previousMillis = 0;
    interval = 1000; // Default 1 second interval
    
    errorCode = 0;
    errorMessage[0] = '\0';
    
    // Set up button pin
    pinMode(encoderButtonPin, INPUT_PULLUP);
}

// Implementation of configureButtonTriggers
void ESP32_MenuSystem::configureButtonTriggers(ButtonTriggerType upTrigger,
                                               ButtonTriggerType downTrigger,
                                               ButtonTriggerType okTrigger,
                                               ButtonTriggerType encoderTrigger)
{
    buttonUpTriggerType = upTrigger;
    buttonDownTriggerType = downTrigger;
    buttonOkTriggerType = okTrigger;
    encoderButtonTriggerType = encoderTrigger;
}

// Implementation of setButtonTrigger
void ESP32_MenuSystem::setButtonTrigger(ButtonID buttonId, ButtonTriggerType triggerType)
{
    switch (buttonId)
    {
    case BUTTON_ID_UP:
        buttonUpTriggerType = triggerType;
        break;
    case BUTTON_ID_DOWN:
        buttonDownTriggerType = triggerType;
        break;
    case BUTTON_ID_OK:
        buttonOkTriggerType = triggerType;
        break;
    case BUTTON_ID_ENCODER:
        encoderButtonTriggerType = triggerType;
        break;
    }
}

// Destructor
// Update the destructor in ESP32_MenuSystem.cpp
ESP32_MenuSystem::~ESP32_MenuSystem() {
    // Clean up encoder if allocated
    if (encoder != nullptr) {
        delete encoder;
    }
    
    // Clean up any dynamically allocated callbacks
    for (int i = 0; i < menuCount; i++) {
        for (int j = 0; j < menus[i].itemCount; j++) {
            if (menus[i].items[j].callback != nullptr) {
                delete menus[i].items[j].callback;
                menus[i].items[j].callback = nullptr;
            }
        }
    }
}

int ESP32_MenuSystem::addMenu(const char* title) {
    if (menuCount < MAX_MENU_DEPTH) {
        menus[menuCount] = Menu(title, menuCount);
        menuCount++;
        return menuCount - 1;
    }
    return -1;
}

void ESP32_MenuSystem::addMenuItem(int menuIndex, const char* name, int nextMenuId, MenuCallback* callback) {
    if (menuIndex >= 0 && menuIndex < menuCount) {
        menus[menuIndex].addItem(name, nextMenuId, callback);
    }
}

void ESP32_MenuSystem::addValueMenuItem(int menuIndex, const char* name, ValueAdjuster* adjuster) {
    if (menuIndex >= 0 && menuIndex < menuCount) {
        menus[menuIndex].addItem(name, -1, nullptr, adjuster);
    }
}

void ESP32_MenuSystem::setMenuMaxVisibleItems(int menuIndex, int maxItems) {
    if (menuIndex >= 0 && menuIndex < menuCount) {
        menus[menuIndex].maxVisibleItems = maxItems;
    }
}

// Calculate the height of a font
uint8_t ESP32_MenuSystem::getFontHeight(const uint8_t* font) {
    display->setFont(font);
    return display->getMaxCharHeight();
}

// Calculate the approximate width of a character in the font
uint8_t ESP32_MenuSystem::getFontWidth(const uint8_t* font) {
    display->setFont(font);
    // For most monospaced fonts, this will be accurate
    // For variable width fonts, this is an approximation
    return display->getMaxCharWidth();
}

// Update layout based on current font sizes
void ESP32_MenuSystem::updateLayoutForFonts() {
    // Get heights of the fonts
    uint8_t stdFontHeight = getFontHeight(standardFont);
    uint8_t titleFontHeight = getFontHeight(titleFont);
    
    // Adjust title height based on the title font
    titleHeight = titleFontHeight + 2; // Add a little padding
    
    // Separator follows directly after title
    separatorY = titleHeight;
    
    // Menu starts below the separator with some padding
    menuStartY = separatorY + 6;
    
    // Line height is based on standard font height plus the specified padding
    lineHeight = stdFontHeight + menuItemPadding;
    
    // Calculate how many menu items can fit on the screen
    int availableHeight = screenHeight - menuStartY;
    menuItemsVisible = availableHeight / lineHeight;
    
