officialdanielamani/ESP_MenuSystem/src/ESP32_MenuSystem.cpp
    // Ensure at least one item is visible
    if (menuItemsVisible < 1) menuItemsVisible = 1;
}

// Update screen size to also consider fonts
void ESP32_MenuSystem::setScreenSize(uint16_t width, uint16_t height) {
    screenWidth = width;
    screenHeight = height;
    
    // Set initial layout parameters based on screen size
    titleHeight = (height < 64) ? 10 : ((height >= 128) ? 16 : 12);
    separatorY = titleHeight;
    menuStartY = separatorY + 10;
    lineHeight = (height <= 32) ? 8 : ((height >= 128) ? 12 : 10);
    
    // Calculate visible items
    int availableHeight = screenHeight - menuStartY;
    menuItemsVisible = availableHeight / lineHeight;
    
    // Ensure at least one item is visible
    if (menuItemsVisible < 1) menuItemsVisible = 1;
    
    // Scroll indicator width
    scrollIndicatorWidth = 3;
}

void ESP32_MenuSystem::setDisplayOffset(int16_t x, int16_t y) {
    displayOffsetX = x;
    displayOffsetY = y;
    useDisplayOffset = true;
}

void ESP32_MenuSystem::clearDisplayOffset() {
    displayOffsetX = 0;
    displayOffsetY = 0;
    useDisplayOffset = false;
}

void ESP32_MenuSystem::setLayoutParameters(uint8_t titleH, uint8_t sepY, uint8_t startY, uint8_t lineH) {
    titleHeight = titleH;
    separatorY = sepY;
    menuStartY = startY;
    lineHeight = lineH;
    
    // Calculate appropriate padding based on line height and font height
    uint8_t stdFontHeight = getFontHeight(standardFont);
    menuItemPadding = (lineH > stdFontHeight) ? (lineH - stdFontHeight) : 0;
}

// Update the moveUp method for BoolValueAdjuster
void ESP32_MenuSystem::moveUp() {
    if (isValueAdjustMode && currentValueAdjuster) {
        if (currentValueAdjuster->getType() == ADJUSTER_TYPE_BOOL) {
            // Set temp value to true for boolean adjuster
            BoolValueAdjuster* boolAdjuster = static_cast<BoolValueAdjuster*>(currentValueAdjuster);
            boolAdjuster->setTempValue(true);
            return;
        }
        
        // Original value adjust handling
        if (currentValueAdjuster) {
            float value = currentValueAdjuster->getValue();
            float increment = currentValueAdjuster->getIncrement();
            currentValueAdjuster->setValue(value + increment);
        }
    } else {
        // Original menu navigation
        if (cursorPosition > 0) {
            cursorPosition--;
        } else {
            // Wrap around to bottom
            Menu* currentMenu = getCurrentMenu();
            if (currentMenu) {
                cursorPosition = currentMenu->itemCount - 1;
            }
        }
    }
}

// Update the moveDown method
void ESP32_MenuSystem::moveDown() {
    if (isValueAdjustMode && currentValueAdjuster) {
        if (currentValueAdjuster->getType() == ADJUSTER_TYPE_BOOL) {
            // Set temp value to false for boolean adjuster
            BoolValueAdjuster* boolAdjuster = static_cast<BoolValueAdjuster*>(currentValueAdjuster);
            boolAdjuster->setTempValue(false);
            return;
        }
        
        // Original value adjust handling
        if (currentValueAdjuster) {
            float value = currentValueAdjuster->getValue();
            float increment = currentValueAdjuster->getIncrement();
            currentValueAdjuster->setValue(value - increment);
        }
    } else {
        // Original menu navigation
        Menu* currentMenu = getCurrentMenu();
        if (currentMenu) {
            if (cursorPosition < currentMenu->itemCount - 1) {
                cursorPosition++;
            } else {
                // Wrap around to top
                cursorPosition = 0;
            }
        }
    }
}

void ESP32_MenuSystem::select() {
    Menu* currentMenu = getCurrentMenu();
    if (currentMenu && cursorPosition < currentMenu->itemCount) {
        MenuItem* selectedItem = &currentMenu->items[cursorPosition];
        
        // Check if this is a value adjustment item
        if (selectedItem->valueAdjuster != nullptr) {
            // Enter value adjustment mode
            enterValueAdjustMode(selectedItem->valueAdjuster);
        } else {
            // Execute callback if it exists
            if (selectedItem->callback) {
                selectedItem->callback->execute();
            }
            
            // Navigate to next menu if specified
            if (selectedItem->nextMenuId >= 0) {
                int nextMenuIndex = findMenuById(selectedItem->nextMenuId);
                if (nextMenuIndex >= 0) {
                    currentMenuIndex = nextMenuIndex;
                    cursorPosition = 0; // Reset cursor position for new menu
                }
            }
        }
    }
}

void ESP32_MenuSystem::goBack() {
    if (currentMenuIndex > 0) {
        currentMenuIndex = 0; // Go back to main menu
        cursorPosition = 0;
    }
}

void ESP32_MenuSystem::setCurrentMenu(int menuId) {
    int menuIndex = findMenuById(menuId);
    if (menuIndex >= 0) {
        currentMenuIndex = menuIndex;
        cursorPosition = 0;
    }
}

void ESP32_MenuSystem::checkButtons() {
    // Only applicable in button mode
    if (inputMode != INPUT_BUTTONS) return;
    
    // Read the current state of buttons based on their individual trigger types
    bool currentUpState = (buttonUpTriggerType == TRIGGER_LOW) ? 
                         (digitalRead(buttonUpPin) == LOW) : 
                         (digitalRead(buttonUpPin) == HIGH);
                         
    bool currentDownState = (buttonDownTriggerType == TRIGGER_LOW) ? 
                           (digitalRead(buttonDownPin) == LOW) : 
                           (digitalRead(buttonDownPin) == HIGH);
                           
    bool currentOkState = (buttonOkTriggerType == TRIGGER_LOW) ? 
                         (digitalRead(buttonOkPin) == LOW) : 
                         (digitalRead(buttonOkPin) == HIGH);
    
    unsigned long currentMillis = millis();
    
    // Check UP button
    if (currentUpState != lastButtonUpState) {
        lastDebounceTime = currentMillis;
    }
    
    if ((currentMillis - lastDebounceTime) > debounceDelay) {
        if (currentUpState != buttonUpState) {
            buttonUpState = currentUpState;
            if (buttonUpState) {
                if (isValueAdjustMode && currentValueAdjuster != nullptr) {
                    // Increase value
                    float value = currentValueAdjuster->getValue();
                    float increment = currentValueAdjuster->getIncrement();
                    currentValueAdjuster->setValue(value + increment);
                } else {
                    moveUp();
                }
            }
        }
    }
    
