officialdanielamani/ESP_MenuSystem/src/ESP32_MenuSystem.cpp
    // Check DOWN button
    if (currentDownState != lastButtonDownState) {
        lastDebounceTime = currentMillis;
    }
    
    if ((currentMillis - lastDebounceTime) > debounceDelay) {
        if (currentDownState != buttonDownState) {
            buttonDownState = currentDownState;
            if (buttonDownState) {
                if (isValueAdjustMode && currentValueAdjuster != nullptr) {
                    // Decrease value
                    float value = currentValueAdjuster->getValue();
                    float increment = currentValueAdjuster->getIncrement();
                    currentValueAdjuster->setValue(value - increment);
                } else {
                    moveDown();
                }
            }
        }
    }
    
    // Check OK button
    if (currentOkState != lastButtonOkState) {
        lastDebounceTime = currentMillis;
    }
    
    if ((currentMillis - lastDebounceTime) > debounceDelay) {
        if (currentOkState != buttonOkState) {
            buttonOkState = currentOkState;
            if (buttonOkState) {
                if (errorCode > 0) {
                    clearError();
                } else if (isValueAdjustMode && currentValueAdjuster) {
                    // Check for boolean adjuster
                    if (currentValueAdjuster->getType() == ADJUSTER_TYPE_BOOL) {
                        BoolValueAdjuster* boolAdjuster = static_cast<BoolValueAdjuster*>(currentValueAdjuster);
                        // Apply the temporary selection to the actual value
                        boolAdjuster->applyTempValue();
                    }
                    exitValueAdjustMode();
                } else {
                    select();
                }
            }
        }
    }
    
    lastButtonUpState = currentUpState;
    lastButtonDownState = currentDownState;
    lastButtonOkState = currentOkState;
}

// Update the handleEncoderMovement method in ESP32_MenuSystem.cpp
void ESP32_MenuSystem::handleEncoderMovement() {
    // Only applicable in encoder mode
    if (inputMode != INPUT_ENCODER || encoder == nullptr) return;
    
    long currentEncoderValue;
    
    #ifdef USE_ESP32_ENCODER
        currentEncoderValue = encoder->getCount();
    #else
        currentEncoderValue = encoder->read();
    #endif
    
    if (currentEncoderValue != lastEncoderValue) {
        // Determine direction (UP or DOWN)
        int8_t encoderDir = (currentEncoderValue > lastEncoderValue) ? 1 : -1;
        
        // Add to accumulator
        encoderAccumulator += encoderDir;
        
        // Only process if accumulator exceeds sensitivity threshold
        if (abs(encoderAccumulator) >= encoderSensitivity) {
            // Determine the direction based on accumulator
            int8_t movementDir = (encoderAccumulator > 0) ? 1 : -1;
            
            if (isValueAdjustMode && currentValueAdjuster != nullptr) {
                // Special handling for boolean adjusters
                if (currentValueAdjuster->getType() == ADJUSTER_TYPE_BOOL) {
                    BoolValueAdjuster* boolAdjuster = static_cast<BoolValueAdjuster*>(currentValueAdjuster);
                    
                    // Change the temp selection based on direction
                    // Clockwise (positive) = true, Counter-clockwise (negative) = false
                    boolAdjuster->setTempValue(movementDir > 0);
                } else {
                    // For non-boolean adjusters, use the original value adjustment
                    float currentValue = currentValueAdjuster->getValue();
                    float increment = currentValueAdjuster->getIncrement();
                    
                    // Apply increment based on direction
                    float newValue = currentValue + (increment * movementDir);
                    
                    // Apply limits and set value
                    currentValueAdjuster->setValue(newValue);
                }
            } else {
                // Regular menu navigation
                if (movementDir > 0) {
                    // Move cursor down
                    moveDown();
                } else {
                    // Move cursor up
                    moveUp();
                }
            }
            
            // Reset accumulator (keep the remainder for smoother sensitivity)
            encoderAccumulator = encoderAccumulator % encoderSensitivity;
        }
        
        // Update last value
        lastEncoderValue = currentEncoderValue;
    }
}

void ESP32_MenuSystem::handleButtonPress() {
    // Only applicable in encoder mode
    if (inputMode != INPUT_ENCODER) return;
    
    // Read the state of the encoder button based on its trigger type
    bool currentButtonState = (encoderButtonTriggerType == TRIGGER_LOW) ? 
                             (digitalRead(encoderButtonPin) == LOW) : 
                             (digitalRead(encoderButtonPin) == HIGH);
    
    // Check if the button state changed
    if (currentButtonState != lastEncoderButtonState) {
        lastDebounceTime = millis();
    }
    
    // Debounce
    if ((millis() - lastDebounceTime) > debounceDelay) {
        if (currentButtonState != encoderButtonState) {
            encoderButtonState = currentButtonState;
            
            if (encoderButtonState) {
                if (errorCode > 0) {
                    clearError();
                } else if (isValueAdjustMode && currentValueAdjuster) {
                    // Check for boolean adjuster
                    if (currentValueAdjuster->getType() == ADJUSTER_TYPE_BOOL) {
                        BoolValueAdjuster* boolAdjuster = static_cast<BoolValueAdjuster*>(currentValueAdjuster);
                        // Apply the temporary selection to the actual value
                        boolAdjuster->applyTempValue();
                    }
                    exitValueAdjustMode();
                } else {
                    select();
                }
            }
        }
    }
    
