officialdanielamani/ESP_MenuSystem/src/ESP32_MenuSystem.cpp
    lastEncoderButtonState = currentButtonState;
}

void ESP32_MenuSystem::enterValueAdjustMode(ValueAdjuster* adjuster) {
    isValueAdjustMode = true;
    currentValueAdjuster = adjuster;
    
    // For boolean adjusters, initialize temp value to current value
    if (adjuster->getType() == ADJUSTER_TYPE_BOOL) {
        BoolValueAdjuster* boolAdjuster = static_cast<BoolValueAdjuster*>(adjuster);
        boolAdjuster->setTempValue(boolAdjuster->isTrue());
    }
    
    // If using encoder, reset count to prevent sudden jumps
    if (inputMode == INPUT_ENCODER && encoder != nullptr) {
        #ifdef USE_ESP32_ENCODER
            lastEncoderValue = encoder->getCount();
        #else
            lastEncoderValue = encoder->read();
        #endif
    }
}

void ESP32_MenuSystem::displayMenu() {
    if (errorCode > 0) {
        displayError();
        return;
    }
    
    if (isValueAdjustMode && currentValueAdjuster) {
        // Check adjuster type
        if (currentValueAdjuster->getType() == ADJUSTER_TYPE_BOOL) {
            // Use boolean display 
            displayBoolAdjust();
        } else {
            // Use standard value adjust display for other types
            displayValueAdjust();
        }
        return;
    }
    
    Menu* currentMenu = getCurrentMenu();
    if (!currentMenu) return;
    
    display->clearBuffer();
    display->setFont(titleFont);
    
    // Draw title - apply offset if enabled
    int16_t cursorX = 0;
    int16_t cursorY = titleHeight - 2;
    if (useDisplayOffset) {
        cursorX += displayOffsetX;
        cursorY += displayOffsetY;
    }
    display->setCursor(cursorX, cursorY);
    display->print(currentMenu->title);
    
    // Draw separator line - apply offset if enabled
    int16_t lineX = 0;
    int16_t lineY = separatorY;
    if (useDisplayOffset) {
        lineX += displayOffsetX;
        lineY += displayOffsetY;
    }
    display->drawHLine(lineX, lineY, screenWidth);
    
    display->setFont(standardFont);

    // Determine how many items will be visible
    int visibleItems = menuItemsVisible;  // Default (calculated based on screen size)
    
    // If the menu has a custom max visible items setting, use that instead
    if (currentMenu->maxVisibleItems > 0 && currentMenu->maxVisibleItems < visibleItems) {
        visibleItems = currentMenu->maxVisibleItems;
    }
    
    // Calculate which items to display (for scrolling support)
    int displayStart = 0;
    
    // If cursor position is outside visible area, adjust start position
    if (cursorPosition >= visibleItems) {
        displayStart = cursorPosition - visibleItems + 1;
    }
    
    // Make sure we don't try to display past the end
    if (displayStart + visibleItems > currentMenu->itemCount) {
        displayStart = currentMenu->itemCount - visibleItems;
        if (displayStart < 0) displayStart = 0;
    }
    
    // Display the visible items
    for (int i = 0; i < visibleItems && (i + displayStart) < currentMenu->itemCount; i++) {
        int itemIndex = i + displayStart;
        
        // Calculate Y position with minimal spacing
        int16_t yPos = menuStartY + i * (getFontHeight(standardFont) + menuItemPadding);  // Minimal 1px padding
        // ...menuItemPadding
        int16_t leftX = 0;
        int16_t indentedX = 10;
        
        if (useDisplayOffset) {
            yPos += displayOffsetY;
            leftX += displayOffsetX;
            indentedX += displayOffsetX;
        }
        
        if (itemIndex == cursorPosition) {
            display->setCursor(leftX, yPos);
            display->print("> ");
        } else {
            display->setCursor(indentedX, yPos);
        }
        display->print(currentMenu->items[itemIndex].name);
        
        // If this item has a value adjuster, show the current value
        if (currentMenu->items[itemIndex].valueAdjuster != nullptr) {
            ValueAdjuster* adjuster = currentMenu->items[itemIndex].valueAdjuster;
            float value = adjuster->getValue();
            int decimals = adjuster->getDecimalPlaces();
            const char* unit = adjuster->getUnit();
            
            // Format value string based on decimals
            char valueStr[20];
            if (decimals > 0) {
                char format[10];
                sprintf(format, "%%.%df", decimals);
                sprintf(valueStr, format, value);
            } else {
                sprintf(valueStr, "%.0f", value);
            }
            
            // Display value at right side of screen - adjust for screen width
            int16_t xPos = screenWidth - (strlen(valueStr) + strlen(unit) + 1) * 6;
            if (useDisplayOffset) {
                xPos += displayOffsetX;
            }
            display->setCursor(xPos, yPos);
            display->print(valueStr);
            display->print(unit);
        }
    }

    // Draw scroll indicator if needed (if there are more items than visible)
    bool needScrolling = currentMenu->itemCount > visibleItems;
    if (needScrolling) {
        // Calculate scroll bar height and position
        int availableScrollHeight = visibleItems * lineHeight;
        int scrollBarHeight = (visibleItems * availableScrollHeight) / currentMenu->itemCount;
        if (scrollBarHeight < 4) scrollBarHeight = 4; // Minimum size
        
        int16_t scrollBarY = menuStartY;
        if (currentMenu->itemCount > 1) {  // Avoid division by zero
            scrollBarY += (cursorPosition * (availableScrollHeight - scrollBarHeight)) / 
                          (currentMenu->itemCount - 1);
        }
        
        // Apply offset if enabled
        int16_t scrollBarX = screenWidth - scrollIndicatorWidth;
        int16_t startY = menuStartY - (getFontHeight(standardFont) / 2);
        
        if (useDisplayOffset) {
            scrollBarX += displayOffsetX;
            scrollBarY += displayOffsetY;
            startY += displayOffsetY;
        }
        
        // Draw scroll bar at the right edge
        display->drawVLine(scrollBarX, startY, availableScrollHeight);
        display->drawBox(scrollBarX, scrollBarY, scrollIndicatorWidth, scrollBarHeight);
    }

    // Get the selected item, if any
    MenuItem* selectedItem = nullptr;
    if (cursorPosition < currentMenu->itemCount) {
        selectedItem = &currentMenu->items[cursorPosition];
    }

    // Call screen info callback if available
    if (currentMenu->hasScreenInfo && currentMenu->screenInfoCallback) {
        // The callback function can use getDisplayOffsetX() and getDisplayOffsetY() 
        // to apply offsets to its own drawing operations if needed
        currentMenu->screenInfoCallback();
    }

    display->sendBuffer();
}

void ESP32_MenuSystem::addScreenInfo(int menuIndex, ScreenInfoCallback callback) {
    if (menuIndex >= 0 && menuIndex < menuCount) {
        menus[menuIndex].setScreenInfoCallback(callback);
    }
}

void ESP32_MenuSystem::exitValueAdjustMode() {
    isValueAdjustMode = false;
    currentValueAdjuster = nullptr;
}

void ESP32_MenuSystem::displayValueAdjust() {
    if (!currentValueAdjuster) {
        exitValueAdjustMode();
        return;
    }
    
    // Get the value and other properties
    float value = currentValueAdjuster->getValue();
    float min = currentValueAdjuster->getMin();
    float max = currentValueAdjuster->getMax();
    float increment = currentValueAdjuster->getIncrement();
    int decimals = currentValueAdjuster->getDecimalPlaces();
    const char* unit = currentValueAdjuster->getUnit();
    
    display->clearBuffer();
    
    // Title - apply offset if enabled
    display->setFont(titleFont);
    int16_t titleX = 0;
    int16_t titleY = titleHeight - 2;
    if (useDisplayOffset) {
        titleX += displayOffsetX;
        titleY += displayOffsetY;
    }
    display->setCursor(titleX, titleY);
    display->print("Adjust Value");
    
    // Separator line - apply offset if enabled
    int16_t sepX = 0;
    int16_t sepY = separatorY;
    if (useDisplayOffset) {
        sepX += displayOffsetX;
        sepY += displayOffsetY;
    }
    display->drawHLine(sepX, sepY, screenWidth);
    
    // Calculate dimensions for slider
    int sliderY = screenHeight * 0.75;  // 75% down the screen
    int sliderWidth = screenWidth * 0.85;  // 85% of screen width
    int sliderX = (screenWidth - sliderWidth) / 2;  // Center horizontally
    
