officialdanielamani/ESP_MenuSystem/src/ESP32_MenuSystem.cpp
    // Apply offset to slider if enabled
    if (useDisplayOffset) {
        sliderX += displayOffsetX;
        sliderY += displayOffsetY;
    }
    
    // Show current value in large font
    display->setFont(valueFont);
    
    // Format value string based on decimals
    char valueStr[20];
    if (decimals > 0) {
        char format[10];
        sprintf(format, "%%.%df", decimals);
        sprintf(valueStr, format, value);
    } else {
        sprintf(valueStr, "%.0f", value);
    }
    
    // Center the value display and apply offset if enabled
    int valueY = screenHeight * 0.55;  // 55% down the screen
    int strWidth = strlen(valueStr) * 10;  // Approximate width
    int xPos = (screenWidth - strWidth) / 2;
    if (useDisplayOffset) {
        xPos += displayOffsetX;
        valueY += displayOffsetY;
    }
    display->setCursor(xPos, valueY);
    display->print(valueStr);
    
    // Unit text with offset
    display->setFont(standardFont);
    int16_t unitX = xPos + strWidth + 2;
    int16_t unitY = valueY;
    display->setCursor(unitX, unitY);
    display->print(unit);
    
    // Range indicator (horizontal line)
    display->drawHLine(sliderX, sliderY, sliderWidth);
    
    // Calculate position marker based on value's position in range
    int markerPos = sliderX + (int)(sliderWidth * (value - min) / (max - min));
    
    // Draw marker box with offset already applied to markerPos
    display->drawBox(markerPos - 2, sliderY - 2, 5, 5);
    
    // Min and max values with offset
    display->setFont(standardFont);
    
    char minStr[10], maxStr[10];
    if (decimals > 0) {
        char format[10];
        sprintf(format, "%%.%df", decimals);
        sprintf(minStr, format, min);
        sprintf(maxStr, format, max);
    } else {
        sprintf(minStr, "%.0f", min);
        sprintf(maxStr, "%.0f", max);
    }
    
    // Min value with offset
    int16_t minX = sliderX;
    int16_t minY = sliderY + 10;
    display->setCursor(minX, minY);
    display->print(minStr);
    
    // Max value with offset
    int maxWidth = strlen(maxStr) * 6;  // Approximate width of text
    int16_t maxX = sliderX + sliderWidth - maxWidth;
    int16_t maxY = sliderY + 10;
    display->setCursor(maxX, maxY);
    display->print(maxStr);
    
    display->sendBuffer();
}


// Update the displayBoolAdjust method
void ESP32_MenuSystem::displayBoolAdjust()
{
    // Safe cast - we already checked type in displayMenu
    BoolValueAdjuster *boolAdjuster = static_cast<BoolValueAdjuster *>(currentValueAdjuster);

    display->clearBuffer();

    // Title
    display->setFont(titleFont);

    int16_t titleX = 0;
    int16_t titleY = titleHeight - 2;
    if (useDisplayOffset){
        titleX += displayOffsetX;
        titleY += displayOffsetY;
    }

    // Get the current menu item name
    Menu *currentMenu = getCurrentMenu();
    if (currentMenu && cursorPosition < currentMenu->itemCount)
    {
        display->setCursor(titleX, titleY); // Adjusted based on titleHeight
        display->print(currentMenu->items[cursorPosition].name);
    } else {
        display->setCursor(titleX, titleY); // Adjusted based on titleHeight
        display->print("Boolean Setting");
    }

    display->setFont(standardFont);

    // Draw separator
    int16_t sepX = 0;
    int16_t sepY = separatorY;
    if (useDisplayOffset){
        sepX += displayOffsetX;
        sepY += displayOffsetY;
    }
    display->drawHLine(sepX, sepY, screenWidth);

    // Calculate Y positions based on screen height
    int currentValueY = separatorY + (screenHeight - separatorY) * 0.25; // 25% down usable area
    int optionsStartY = separatorY + (screenHeight - separatorY) * 0.6;  // 60% down usable area
    int optionSpacing = (screenHeight - optionsStartY) / 3;              // Divide remaining space

    // Apply offsets if enabled
    int16_t textX = 0;
    int16_t indentedX = 10;
    if (useDisplayOffset){
        textX += displayOffsetX;
        indentedX += displayOffsetX;
        currentValueY += displayOffsetY;
        optionsStartY += displayOffsetY;
        // Note: optionSpacing doesn't need offset as it's a relative measurement
    }

    // Show current stored value with offset
    display->setCursor(textX, currentValueY);
    display->print("Current value");
    display->setCursor(textX, currentValueY + 10);
    display->print("is set to ");
    display->print(boolAdjuster->getCurrentLabel());

    // Show options with selection indicator
    bool tempValue = boolAdjuster->getTempValue();

    // True option with selection indicator
    if (tempValue)
    {
        display->setCursor(textX, optionsStartY);
        display->print("> ");
    } else {
        display->setCursor(indentedX, optionsStartY);
    }
    display->print(boolAdjuster->getTrueLabel());

    // False option with selection indicator
    if (!tempValue){
        display->setCursor(textX, optionsStartY + optionSpacing);
        display->print("> ");
    } else {
        display->setCursor(indentedX, optionsStartY + optionSpacing);
    }
    display->print(boolAdjuster->getFalseLabel());
    display->sendBuffer();
}

void ESP32_MenuSystem::setError(int code, const char* message) {
    errorCode = code;
    strncpy(errorMessage, message, sizeof(errorMessage) - 1);
    errorMessage[sizeof(errorMessage) - 1] = '\0';
}

void ESP32_MenuSystem::clearError() {
    errorCode = 0;
    errorMessage[0] = '\0';
}

void ESP32_MenuSystem::displayError() {
    display->clearBuffer();
    display->setFont(titleFont);  // Use title font
    
    display->setCursor(0, 20);
    display->print("ERROR #");
    display->print(errorCode);
    
    display->setCursor(0, 35);
    display->print(errorMessage);
    
    display->setCursor(0, 50);
    display->print("Press button to continue");
    
    display->sendBuffer();
}

void ESP32_MenuSystem::update() {
    // Handle input based on mode
    if (inputMode == INPUT_BUTTONS) {
        checkButtons();
    } else if (inputMode == INPUT_ENCODER) {
        handleEncoderMovement();
        handleButtonPress();
    }
    
