officialdanielamani/ESP_MenuSystem/src/ESP32_MenuSystem.cpp
    // Display the current menu
    displayMenu();
    
    // Add any other periodic updates here
    unsigned long currentMillis = millis();
    if (currentMillis - previousMillis >= interval) {
        previousMillis = currentMillis;
        // Add any code that needs to run on the interval
    }
}

int ESP32_MenuSystem::findMenuById(int id) {
    for (int i = 0; i < menuCount; i++) {
        if (menus[i].id == id) {
            return i;
        }
    }
    return -1;
}

Menu* ESP32_MenuSystem::getCurrentMenu() {
    if (currentMenuIndex >= 0 && currentMenuIndex < menuCount) {
        return &menus[currentMenuIndex];
    }
    return nullptr;
}

int ESP32_MenuSystem::getCurrentMenuId() const {
    // Get the current menu
    if (currentMenuIndex >= 0 && currentMenuIndex < menuCount) {
        return menus[currentMenuIndex].id;
    }
    return -1;  // Return -1 if there's no valid current menu
}

void ESP32_MenuSystem::begin() {
    // Update layout based on actual font dimensions now that the display is ready
    updateLayoutForFonts();
    
    // If user has set a custom screen size, use those dimensions
    if (display != nullptr) {
        // Get actual display dimensions from U8G2 if possible
        // Not all U8G2 displays provide this info reliably, so we may still need
        // explicit setScreenSize() calls for some displays
        uint16_t displayWidth = display->getDisplayWidth();
        uint16_t displayHeight = display->getDisplayHeight();
        
        // Only update if we got valid dimensions
        if (displayWidth > 0 && displayHeight > 0) {
            screenWidth = displayWidth;
            screenHeight = displayHeight;
            
            // Recalculate layout with new dimensions
            setScreenSize(screenWidth, screenHeight);
        }
    }
}
